[
  {
    "ques": "câu hỏi 1: Biểu mẫu trong cơ sở dữ liệu thường được sử dụng để: ",
    "ans": [
      "a. Thực hiện các phép toán số học",
      "b. Nhập và hiển thị dữ liệu",
      "c. Tạo ra các bảng mới",
      "d. Xóa dữ liệu trong cơ sở dữ liệu"
    ],
    "correct": 1
  },
  {
    "ques": "câu hỏi 2: Để tạo một biểu mẫu đơn giản trong ứng dụng cơ sở dữ liệu, bạn cần: ",
    "ans": [
      "a.Chỉ sử dụng HTML",
      "b. Kết hợp HTML, CSS và JavaScript",
      "c. Sử dụng một công cụ thiết kế GUI hoặc phần mềm quản lý cơ sở dữ liệu",
      "d. Không cần bất kỳ công cụ nào"
    ],
    "correct": 2
  },
  {
    "ques": "câu hỏi 3: Để tạo biểu mẫu ta chọn đối tượng nào trên bảng chọn đối tượng? ",
    "ans": ["a. Queries ", "b. Tables ", "c. Reports", "d. Forms"],
    "correct": 3
  },
  {
    "ques": "câu hỏi 4: Trong Access, ta có thể sử dụng biểu mẫu để",
    "ans": [
      "a. Xem, nhập và sửa dữ liệu ",
      "b. Tính toán cho các trường tính toán",
      "c. Sửa cấu trúc bảng",
      "d. Lập báo cáo"
    ],
    "correct": 0
  },
  {
    "ques": "câu hỏi 5: Chỉnh sửa biểu mẫu (thay đổi hình thức biểu mẫu) chỉ thực hiện được ở chế độ",
    "ans": ["a. Trang dữ liệu", "b. Thiết kế", "c. Biểu mẫu", "d. Thuật sĩ"],
    "correct": 1
  },
  {
    "ques": "câu hỏi 6: Những biểu mẫu cho xem dữ liệu",
    "ans": [
      "a. tổ chức theo thứ tự bảng chữ cái",
      "b. tổ chức theo thứ tự ngày tháng",
      "c. tổ chức theo thứ tự địa chỉ đường",
      "d. không cho phép người xem sửa đổi dữ liệu"
    ],
    "correct": 3
  },
  {
    "ques": "câu hỏi 7: Trong Access, muốn tạo biểu mẫu theo cách dùng thuật sĩ, ta chọn",
    "ans": [
      "a. Create form by using Wizard",
      "b. Create form in using Wizard",
      "c. Create form for using Wizard",
      "d. Create form with using Wizard"
    ],
    "correct": 0
  },
  {
    "ques": "câu hỏi 8: Trong chế độ thiết kế của biểu mẫu, ta có thể",
    "ans": [
      "a. Sửa đổi thiết kế cũ",
      "b. Thiết kế mới cho biểu mẫu , sửa đổi thiết kế cũ",
      "c. Thiết kế mới cho biểu mẫu, xem hay sửa đổi thiết kế cũ",
      "d. Thiết kế mới cho biểu mẫu, xem hay sửa đổi thiết kế cũ, xem, sửa, xóa và nhập dữ liệu"
    ],
    "correct": 3
  },
  {
    "ques": "câu hỏi 9: Các thanh trượt dọt và ngang được dùng để",
    "ans": [
      "a. xem những dữ liệu bị khuất trong cửa sổ biểu mẫu ",
      "b. huyển đến xem bản ghi đứng trước hoặc đứng sau bản ghi hiện thời",
      "c. ọc bản ghi theo điều kiện",
      "d. thay đổi các điều kiện lọc, điều kiện sắp xếp ngay trên biểu mẫu"
    ],
    "correct": 0
  },
  {
    "ques": "câu hỏi 10:  Những ứng dụng CSDL lớn và phức tạp, các biểu mẫu như",
    "ans": [
      "a. Thuộc tính của đối tượng ",
      "b. Chức năng của đối tượng  ",
      "c. Một thành phần của phần mềm ứng dụng",
      "d. Ngôn ngữ lập trình"
    ],
    "correct": 2
  }
]
